balazsgrill/modembed/pic/core/hu.modembed.pic.ui/device-descriptors/18xxxx/PIC18F66K90.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T5CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="T5CON" edc:nzwidth="8" edc:por="0000x000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR5ON" edc:desc="" edc:mask="0x1" edc:name="TMR5ON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RD16" edc:desc="" edc:mask="0x1" edc:name="RD16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="nT5SYNC" edc:desc="" edc:mask="0x1" edc:name="nT5SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SOSCEN" edc:desc="" edc:mask="0x1" edc:name="SOSCEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5CKPS" edc:desc="" edc:mask="0x3" edc:name="T5CKPS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TMR5CS" edc:desc="" edc:mask="0x3" edc:name="TMR5CS" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="T5CKPS0" edc:desc="" edc:mask="0x1" edc:name="T5CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5CKPS1" edc:desc="" edc:mask="0x1" edc:name="T5CKPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR5CS0" edc:desc="" edc:mask="0x1" edc:name="TMR5CS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR5CS1" edc:desc="" edc:mask="0x1" edc:name="TMR5CS1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="TMR5" edc:desc="" edc:name="TMR5" edc:nzwidth="0x10">
          <edc:SFRModeList/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR5L" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="TMR5L" edc:nzwidth="8" edc:por="00000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR5L" edc:desc="" edc:mask="0xff" edc:name="TMR5L" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR5H" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="TMR5H" edc:nzwidth="8" edc:por="xxxxxxxx">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TMR5H" edc:desc="" edc:mask="0xff" edc:name="TMR5H" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMD3" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="PMD3" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR12MD" edc:desc="" edc:mask="0x1" edc:name="TMR12MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP4MD" edc:desc="" edc:mask="0x1" edc:name="CCP4MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP5MD" edc:desc="" edc:mask="0x1" edc:name="CCP5MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP6MD" edc:desc="" edc:mask="0x1" edc:name="CCP6MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP7MD" edc:desc="" edc:mask="0x1" edc:name="CCP7MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP8MD" edc:desc="" edc:mask="0x1" edc:name="CCP8MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP9MD" edc:desc="" edc:mask="0x1" edc:name="CCP9MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP10MD" edc:desc="" edc:mask="0x1" edc:name="CCP10MD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMD2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="PMD2" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CMP1MD" edc:desc="" edc:mask="0x1" edc:name="CMP1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMP2MD" edc:desc="" edc:mask="0x1" edc:name="CMP2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMP3MD" edc:desc="" edc:mask="0x1" edc:name="CMP3MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR5MD" edc:desc="" edc:mask="0x1" edc:name="TMR5MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR6MD" edc:desc="" edc:mask="0x1" edc:name="TMR6MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR7MD" edc:desc="" edc:mask="0x1" edc:name="TMR7MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR8MD" edc:desc="" edc:mask="0x1" edc:name="TMR8MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR10MD" edc:desc="" edc:mask="0x1" edc:name="TMR10MD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnn-" edc:cname="PMD1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-xxxxxx-" edc:name="PMD1" edc:nzwidth="8" edc:por="-000000-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TMR1MD" edc:desc="" edc:mask="0x1" edc:name="TMR1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR2MD" edc:desc="" edc:mask="0x1" edc:name="TMR2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR3MD" edc:desc="" edc:mask="0x1" edc:name="TMR3MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR4MD" edc:desc="" edc:mask="0x1" edc:name="TMR4MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RTCCMD" edc:desc="" edc:mask="0x1" edc:name="RTCCMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTMUMD" edc:desc="" edc:mask="0x1" edc:name="CTMUMD" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PMD0" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="PMD0" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCMD" edc:desc="" edc:mask="0x1" edc:name="ADCMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP1MD" edc:desc="" edc:mask="0x1" edc:name="SSP1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSP2MD" edc:desc="" edc:mask="0x1" edc:name="SSP2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UART1MD" edc:desc="" edc:mask="0x1" edc:name="UART1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="UART2MD" edc:desc="" edc:mask="0x1" edc:name="UART2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP1MD" edc:desc="" edc:mask="0x1" edc:name="CCP1MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2MD" edc:desc="" edc:mask="0x1" edc:name="CCP2MD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP3MD" edc:desc="" edc:mask="0x1" edc:name="CCP3MD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-nnnnn" edc:cname="PSTR3CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xx-xxxxx" edc:name="PSTR3CON" edc:nzwidth="8" edc:por="00-00001">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STRA" edc:desc="" edc:mask="0x1" edc:name="STRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRB" edc:desc="" edc:mask="0x1" edc:name="STRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRC" edc:desc="" edc:mask="0x1" edc:name="STRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRD" edc:desc="" edc:mask="0x1" edc:name="STRD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRSYNC" edc:desc="" edc:mask="0x1" edc:name="STRSYNC" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CMPL" edc:desc="" edc:mask="0x3" edc:name="CMPL" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="CMPL0" edc:desc="" edc:mask="0x1" edc:name="CMPL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMPL1" edc:desc="" edc:mask="0x1" edc:name="CMPL1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-nnnnn" edc:cname="PSTR2CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xx-xxxxx" edc:name="PSTR2CON" edc:nzwidth="8" edc:por="00-00001">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STRA" edc:desc="" edc:mask="0x1" edc:name="STRA" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRB" edc:desc="" edc:mask="0x1" edc:name="STRB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRC" edc:desc="" edc:mask="0x1" edc:name="STRC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRD" edc:desc="" edc:mask="0x1" edc:name="STRD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STRSYNC" edc:desc="" edc:mask="0x1" edc:name="STRSYNC" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CMPL" edc:desc="" edc:mask="0x3" edc:name="CMPL" edc:nzwidth="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="CMPL0" edc:desc="" edc:mask="0x1" edc:name="CMPL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMPL1" edc:desc="" edc:mask="0x1" edc:name="CMPL1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
