balazsgrill/modembed/pic/core/hu.modembed.pic.ui/device-descriptors/18xxxx/PIC18F66K90.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PR12" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="PR12" edc:nzwidth="8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR12" edc:desc="" edc:mask="0xff" edc:name="PR12" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR12" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="TMR12" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR12" edc:desc="" edc:mask="0xff" edc:name="TMR12" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="T10CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-xxxxxxx" edc:name="T10CON" edc:nzwidth="8" edc:por="-0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T10CKPS" edc:desc="" edc:mask="0x3" edc:name="T10CKPS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TMR10ON" edc:desc="" edc:mask="0x1" edc:name="TMR10ON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T10OUTPS" edc:desc="" edc:mask="0xf" edc:name="T10OUTPS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T10CKPS0" edc:desc="" edc:mask="0x1" edc:name="T10CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T10CKPS1" edc:desc="" edc:mask="0x1" edc:name="T10CKPS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T10OUTPS0" edc:desc="" edc:mask="0x1" edc:name="T10OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T10OUTPS1" edc:desc="" edc:mask="0x1" edc:name="T10OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T10OUTPS2" edc:desc="" edc:mask="0x1" edc:name="T10OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T10OUTPS3" edc:desc="" edc:mask="0x1" edc:name="T10OUTPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PR10" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="PR10" edc:nzwidth="8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR10" edc:desc="" edc:mask="0xff" edc:name="PR10" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR10" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="TMR10" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR10" edc:desc="" edc:mask="0xff" edc:name="TMR10" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="T8CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-xxxxxxx" edc:name="T8CON" edc:nzwidth="8" edc:por="-0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T8CKPS" edc:desc="" edc:mask="0x3" edc:name="T8CKPS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TMR8ON" edc:desc="" edc:mask="0x1" edc:name="TMR8ON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T8OUTPS" edc:desc="" edc:mask="0xf" edc:name="T8OUTPS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T8CKPS0" edc:desc="" edc:mask="0x1" edc:name="T8CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T8CKPS1" edc:desc="" edc:mask="0x1" edc:name="T8CKPS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T8OUTPS0" edc:desc="" edc:mask="0x1" edc:name="T8OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T8OUTPS1" edc:desc="" edc:mask="0x1" edc:name="T8OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T8OUTPS2" edc:desc="" edc:mask="0x1" edc:name="T8OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T8OUTPS3" edc:desc="" edc:mask="0x1" edc:name="T8OUTPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PR8" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="PR8" edc:nzwidth="8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR8" edc:desc="" edc:mask="0xff" edc:name="PR8" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR8" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="TMR8" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR8" edc:desc="" edc:mask="0xff" edc:name="TMR8" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="T6CON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-xxxxxxx" edc:name="T6CON" edc:nzwidth="8" edc:por="-0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T6CKPS" edc:desc="" edc:mask="0x3" edc:name="T6CKPS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="TMR6ON" edc:desc="" edc:mask="0x1" edc:name="TMR6ON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS" edc:desc="" edc:mask="0xf" edc:name="T6OUTPS" edc:nzwidth="4"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T6CKPS0" edc:desc="" edc:mask="0x1" edc:name="T6CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6CKPS1" edc:desc="" edc:mask="0x1" edc:name="T6CKPS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS0" edc:desc="" edc:mask="0x1" edc:name="T6OUTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS1" edc:desc="" edc:mask="0x1" edc:name="T6OUTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS2" edc:desc="" edc:mask="0x1" edc:name="T6OUTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T6OUTPS3" edc:desc="" edc:mask="0x1" edc:name="T6OUTPS3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PR6" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="PR6" edc:nzwidth="8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PR6" edc:desc="" edc:mask="0xff" edc:name="PR6" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR6" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="TMR6" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR6" edc:desc="" edc:mask="0xff" edc:name="TMR6" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="T7GCON" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="T7GCON" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T7GSS" edc:desc="" edc:mask="0x3" edc:name="T7GSS" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="T7GVAL" edc:desc="" edc:mask="0x1" edc:name="T7GVAL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T7GGO_nT7DONE" edc:desc="" edc:mask="0x1" edc:name="T7GGO_nT7DONE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T7GSPM" edc:desc="" edc:mask="0x1" edc:name="T7GSPM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T7GTM" edc:desc="" edc:mask="0x1" edc:name="T7GTM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T7GPOL" edc:desc="" edc:mask="0x1" edc:name="T7GPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR7GE" edc:desc="" edc:mask="0x1" edc:name="TMR7GE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T7GSS0" edc:desc="" edc:mask="0x1" edc:name="T7GSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T7GSS1" edc:desc="" edc:mask="0x1" edc:name="T7GSS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T7GGO" edc:desc="" edc:mask="0x1" edc:name="T7GGO" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="nT7DONE" edc:desc="" edc:mask="0x1" edc:name="nT7DONE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
